Revit 2027 API
View.HideCategoriesTemporary Method
 Set multiple categories to be temporarily hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void HideCategoriesTemporary(
	ICollection<ElementId> elementIds
)
Public Sub HideCategoriesTemporary (
	elementIds As ICollection(Of ElementId)
)
public:
void HideCategoriesTemporary(
	ICollection<ElementId^>^ elementIds
)
member HideCategoriesTemporary :
        elementIds : ICollection<ElementId> -> unit
Parameters
elementIds ICollection<ElementId>
 Ids of the categories to be hidden
Exceptions
Exception | Condition
ArgumentException |  Some elements in elementIds do not correspond to a Category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View Class
Autodesk.Revit.DB Namespace